#include <iostream>
#include <vector>

int main() {
    int N, T; // Оголошення змінних

    // Запит а на введення розміру масиву
    std::cout << "Введіть розмір масива N: ";
    std::cin >> N;

    //  виділення пам'яті для масиву 
    int* A = new int[N];

    // Запит користувача на введення елементів масиву
    std::cout << "Введідть числа масива A:\n";
    for (int i = 0; i < N; ++i) {
        std::cin >> A[i];
    }

    // Запит користувача на введення значення T
    std::cout << " T: ";
    std::cin >> T;

    // Оголошення змінних для збереження максимального елемента і його індексу
    int maxElement = -1; // Початкове значення для максимального елемента
    int maxIndex = -1;   // Початкове значення для індексу максимального елемента

    // Прохід по всіх елементах масиву
    for (int i = 0; i < N; ++i) {
        // Перевірка, чи елемент більше за T, додатній і більший або рівний поточному максимуму
        if (A[i] > T && A[i] > 0 && A[i] >= maxElement) {
            maxElement = A[i]; // Оновлення значення максимального елемента
            maxIndex = i;      // Збереження індексу максимального елемента
        }
    }

    // Виведення результату
    if (maxIndex != -1) {
        // Якщо знайдено відповідний елемент, виводимо його індекс та значення
        std::cout << "Номер останнього максимального елемента більше за " << T << ": " << maxIndex << std::endl;
        std::cout << "Значення елемента: " << maxElement << std::endl;
    } else {
        // Якщо таких елементів немає
        std::cout << "Немає чисел більше за " << T << " в масиві." << std::endl;
    }

    // Звільнення пам'яті, виділеної для масиву
    delete[] A;
    return 0;
}
